lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/wiring_analog.c
    if (g_timer_pwm_pin_clr_dppi_channel[index] == ANALOG_PWM_NO_CHANNEL) {
        if (timer_pwm_dppi_acquire_channel(&g_timer_pwm_pin_clr_dppi_channel[index]) == 0U) {
            if (acquired_gpiote != 0U) {
                nrf54l15_gpiote20_release_task_channel(g_timer_pwm_pin_gpiote_channel[index]);
                g_timer_pwm_pin_gpiote_channel[index] = ANALOG_PWM_NO_CHANNEL;
            }
            return 0U;
        }
        acquired_dppi = 1U;
    }

    (void)acquired_dppi;
    return 1U;
}

static uint8_t timer_pwm_ensure_slot_set_channel(uint8_t slot)
{
    if (slot >= ANALOG_TIMER_PWM_SLOT_COUNT) {
        return 0U;
    }

    if (g_timer_pwm_slot_set_dppi_channel[slot] != ANALOG_PWM_NO_CHANNEL) {
        return 1U;
    }

    return timer_pwm_dppi_acquire_channel(&g_timer_pwm_slot_set_dppi_channel[slot]);
}

static void timer_pwm_stop_slot(uint8_t slot)
{
    if (slot >= ANALOG_TIMER_PWM_SLOT_COUNT) {
        return;
    }

    const uintptr_t timer_base = k_timer_pwm_base[slot];
    uint32_t dppi_disable_mask = 0UL;
    if (g_timer_pwm_slot_set_dppi_channel[slot] != ANALOG_PWM_NO_CHANNEL) {
        dppi_disable_mask |=
            timer_pwm_dppi_channel_mask32(g_timer_pwm_slot_set_dppi_channel[slot]);
    }

    *regptr(timer_base, TIMER_TASKS_STOP) = 1U;
    *regptr(timer_base, TIMER_SHORTS) = 0U;
    *regptr(timer_base, TIMER_SUBSCRIBE_START) = 0U;
    *regptr(timer_base, TIMER_SUBSCRIBE_CLEAR) = 0U;

    for (uint8_t compare = 0U; compare < 8U; ++compare) {
        *regptr(timer_base,
                TIMER_PUBLISH_COMPARE0 + ((uintptr_t)compare * TIMER_PUBLISH_COMPARE_STRIDE)) = 0U;
        *regptr(timer_base,
                TIMER_EVENTS_COMPARE0 + ((uintptr_t)compare * TIMER_EVENTS_COMPARE_STRIDE)) = 0U;
    }

    for (uint8_t index = 0U; index < ANALOG_TIMER_PWM_PIN_COUNT; ++index) {
        if ((g_timer_pwm_slot_member_mask[slot] & timer_pwm_pin_mask(index)) == 0U) {
            continue;
        }

        const uint8_t gpiote_channel = g_timer_pwm_pin_gpiote_channel[index];
        if (gpiote_channel != ANALOG_PWM_NO_CHANNEL) {
            *regptr(k_timer_pwm_gpiote_base,
                    GPIOTE_SUBSCRIBE_SET0 +
                        ((uintptr_t)gpiote_channel * GPIOTE_CONFIG_STRIDE)) = 0U;
            *regptr(k_timer_pwm_gpiote_base,
                    GPIOTE_SUBSCRIBE_CLR0 +
                        ((uintptr_t)gpiote_channel * GPIOTE_CONFIG_STRIDE)) = 0U;
        }

        if (g_timer_pwm_pin_clr_dppi_channel[index] != ANALOG_PWM_NO_CHANNEL) {
            dppi_disable_mask |=
                timer_pwm_dppi_channel_mask32(g_timer_pwm_pin_clr_dppi_channel[index]);
        }
    }

    if (dppi_disable_mask != 0UL) {
        *regptr(k_timer_pwm_dppic_base, DPPIC_CHENCLR) = dppi_disable_mask;
    }

    g_timer_pwm_slot_active[slot] = 0U;
}

static void timer_pwm_restart_slot(uint8_t slot)
{
    if (slot >= ANALOG_TIMER_PWM_SLOT_COUNT ||
        g_timer_pwm_slot_member_mask[slot] == 0U ||
        g_timer_pwm_slot_set_dppi_channel[slot] == ANALOG_PWM_NO_CHANNEL) {
        return;
    }

    const uintptr_t timer_base = k_timer_pwm_base[slot];
    const uint8_t set_dppi_channel = g_timer_pwm_slot_set_dppi_channel[slot];
    uint32_t dppi_enable_mask = timer_pwm_dppi_channel_mask32(set_dppi_channel);

    timer_pwm_stop_slot(slot);

    *regptr(timer_base, TIMER_TASKS_CLEAR) = 1U;
    *regptr(timer_base, TIMER_MODE) = TIMER_MODE_TIMER;
    *regptr(timer_base, TIMER_BITMODE) = TIMER_BITMODE_32;
    *regptr(timer_base, TIMER_PRESCALER) = (uint32_t)g_timer_pwm_slot_prescaler[slot];
    *regptr(timer_base, TIMER_SHORTS) = TIMER_SHORT_COMPARE0_CLEAR;
    *regptr(timer_base, TIMER_CC0 + ((uintptr_t)ANALOG_TIMER_PWM_PERIOD_CHANNEL * TIMER_CC_STRIDE)) =
        g_timer_pwm_slot_period_ticks[slot];
    *regptr(timer_base, TIMER_PUBLISH_COMPARE0) = dppi_config_value(set_dppi_channel);

    for (uint8_t index = 0U; index < ANALOG_TIMER_PWM_PIN_COUNT; ++index) {
        if ((g_timer_pwm_slot_member_mask[slot] & timer_pwm_pin_mask(index)) == 0U) {
            continue;
        }

        const uint8_t gpiote_channel = g_timer_pwm_pin_gpiote_channel[index];
        const uint8_t clr_dppi_channel = g_timer_pwm_pin_clr_dppi_channel[index];
        const uint8_t compare_channel = timer_pwm_compare_channel_for_pin(index);
        uint8_t port = 0U;
        uint8_t pin = 0U;

        if (gpiote_channel == ANALOG_PWM_NO_CHANNEL ||
            clr_dppi_channel == ANALOG_PWM_NO_CHANNEL ||
            resolve_pwm_gpio(index, &port, &pin) == 0U) {
            continue;
        }

        uint32_t gpiote_config = 0U;
        gpiote_config |= (GPIOTE_CONFIG_MODE_TASK << GPIOTE_CONFIG_MODE_Pos);
        gpiote_config |= ((uint32_t)(pin & 0x1FU) << GPIOTE_CONFIG_PSEL_Pos);
        gpiote_config |= ((uint32_t)(port & 0x7U) << GPIOTE_CONFIG_PORT_Pos);
        gpiote_config |= (GPIOTE_CONFIG_POLARITY_NONE << GPIOTE_CONFIG_POLARITY_Pos);
        gpiote_config |= (0UL << GPIOTE_CONFIG_OUTINIT_Pos);
        *regptr(k_timer_pwm_gpiote_base,
                GPIOTE_CONFIG0 + ((uintptr_t)gpiote_channel * GPIOTE_CONFIG_STRIDE)) =
            gpiote_config;
        *regptr(k_timer_pwm_gpiote_base,
                GPIOTE_SUBSCRIBE_SET0 + ((uintptr_t)gpiote_channel * GPIOTE_CONFIG_STRIDE)) =
            dppi_config_value(set_dppi_channel);
        *regptr(k_timer_pwm_gpiote_base,
                GPIOTE_SUBSCRIBE_CLR0 + ((uintptr_t)gpiote_channel * GPIOTE_CONFIG_STRIDE)) =
            dppi_config_value(clr_dppi_channel);
        *regptr(timer_base,
                TIMER_CC0 + ((uintptr_t)compare_channel * TIMER_CC_STRIDE)) =
            g_timer_pwm_pin_high_ticks[index];
        *regptr(timer_base,
                TIMER_PUBLISH_COMPARE0 +
                    ((uintptr_t)compare_channel * TIMER_PUBLISH_COMPARE_STRIDE)) =
            dppi_config_value(clr_dppi_channel);
        *regptr(timer_base,
                TIMER_EVENTS_COMPARE0 +
                    ((uintptr_t)compare_channel * TIMER_EVENTS_COMPARE_STRIDE)) = 0U;
        dppi_enable_mask |= timer_pwm_dppi_channel_mask32(clr_dppi_channel);
        g_pwm_pin_software[index] = 0U;
        g_soft_pwm_on_time_us[index] = 0UL;
        g_soft_pwm_output_high[index] = 1U;
    }

    *regptr(k_timer_pwm_dppic_base, DPPIC_CHENSET) = dppi_enable_mask;

    for (uint8_t index = 0U; index < ANALOG_TIMER_PWM_PIN_COUNT; ++index) {
        if ((g_timer_pwm_slot_member_mask[slot] & timer_pwm_pin_mask(index)) == 0U) {
            continue;
        }

        const uint8_t gpiote_channel = g_timer_pwm_pin_gpiote_channel[index];
        if (gpiote_channel != ANALOG_PWM_NO_CHANNEL) {
            *regptr(k_timer_pwm_gpiote_base,
                    GPIOTE_TASKS_SET0 + ((uintptr_t)gpiote_channel * GPIOTE_CONFIG_STRIDE)) = 1U;
        }
    }

    *regptr(timer_base, TIMER_TASKS_START) = 1U;
    g_timer_pwm_slot_active[slot] = 1U;
}

static uint8_t timer_pwm_hold_pin_static(uint8_t index, uint8_t high)
{
    uint8_t port = 0U;
    uint8_t pin = 0U;
    if (index >= ANALOG_PWM_PIN_COUNT ||
        g_pwm_pin_timer_slot[index] == ANALOG_PWM_NO_SLOT ||
        resolve_pwm_gpio(index, &port, &pin) == 0U) {
        return 0U;
    }

    timer_pwm_release_pin(index);
    gpio_write_raw(port, pin, high);
    g_pwm_pin_software[index] = 0U;
    g_soft_pwm_on_time_us[index] = 0UL;
    g_soft_pwm_output_high[index] = high;
    return 1U;
}

