lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/wiring_analog.c
static uint8_t timer_pwm_update_pin_live(uint8_t slot,
                                         uint8_t index,
                                         uint8_t prescaler,
                                         uint32_t period_ticks,
                                         uint32_t high_ticks)
{
    if (slot >= ANALOG_TIMER_PWM_SLOT_COUNT || index >= ANALOG_PWM_PIN_COUNT) {
        return 0U;
    }

    if (g_pwm_pin_timer_slot[index] != slot ||
        (g_timer_pwm_slot_member_mask[slot] & timer_pwm_pin_mask(index)) == 0U ||
        g_timer_pwm_pin_gpiote_channel[index] == ANALOG_PWM_NO_CHANNEL ||
        g_timer_pwm_slot_active[slot] == 0U ||
        g_timer_pwm_slot_prescaler[slot] != prescaler ||
        g_timer_pwm_slot_period_ticks[slot] != period_ticks) {
        return 0U;
    }

    const uintptr_t timer_base = k_timer_pwm_base[slot];
    const uint8_t gpiote_channel = g_timer_pwm_pin_gpiote_channel[index];
    const uint8_t compare_channel = timer_pwm_compare_channel_for_pin(index);
    const uint32_t current_high_ticks = g_timer_pwm_pin_high_ticks[index];
    const uint32_t phase_ticks = timer_pwm_capture_phase_ticks(timer_base, period_ticks);

    // Apply the compare immediately so the next cycle already uses the new duty.
    // When the pin is currently high and the new compare has already passed,
    // force only the falling edge. Do not synthesize a new mid-cycle high phase
    // for upward duty updates, as that is what produces the 1 ms / multi-pin glitch.
    *regptr(timer_base, TIMER_CC0 + ((uintptr_t)compare_channel * TIMER_CC_STRIDE)) = high_ticks;
    *regptr(timer_base,
            TIMER_EVENTS_COMPARE0 + ((uintptr_t)compare_channel * TIMER_EVENTS_COMPARE_STRIDE)) = 0U;
    g_timer_pwm_pin_high_ticks[index] = high_ticks;

    if (gpiote_channel != ANALOG_PWM_NO_CHANNEL &&
        current_high_ticks != 0UL &&
        phase_ticks < current_high_ticks &&
        (phase_ticks + 1UL) >= high_ticks) {
        *regptr(k_timer_pwm_gpiote_base,
                GPIOTE_TASKS_CLR0 + ((uintptr_t)gpiote_channel * GPIOTE_CONFIG_STRIDE)) = 1U;
    }

    g_pwm_pin_software[index] = 0U;
    g_soft_pwm_on_time_us[index] = 0UL;
    g_soft_pwm_output_high[index] = 1U;
    return 1U;
}

static void timer_pwm_service_pending_updates(void)
{
}

static void timer_pwm_release_pin(uint8_t index)
{
    if (index >= ANALOG_PWM_PIN_COUNT) {
        return;
    }

    const uint8_t slot = g_pwm_pin_timer_slot[index];
    if (slot == ANALOG_PWM_NO_SLOT || slot >= ANALOG_TIMER_PWM_SLOT_COUNT) {
        return;
    }

    const uint8_t pin_mask = timer_pwm_pin_mask(index);
    const uint8_t gpiote_channel = g_timer_pwm_pin_gpiote_channel[index];
    const uint8_t clr_dppi_channel = g_timer_pwm_pin_clr_dppi_channel[index];
    const uint8_t compare_channel = timer_pwm_compare_channel_for_pin(index);

    if ((g_timer_pwm_slot_member_mask[slot] & pin_mask) != 0U) {
        *regptr(k_timer_pwm_dppic_base, DPPIC_CHENCLR) =
            timer_pwm_dppi_channel_mask32(clr_dppi_channel);
        *regptr(k_timer_pwm_base[slot],
                TIMER_PUBLISH_COMPARE0 +
                    ((uintptr_t)compare_channel * TIMER_PUBLISH_COMPARE_STRIDE)) = 0U;
        *regptr(k_timer_pwm_base[slot],
                TIMER_EVENTS_COMPARE0 +
                    ((uintptr_t)compare_channel * TIMER_EVENTS_COMPARE_STRIDE)) = 0U;
        g_timer_pwm_slot_member_mask[slot] &= (uint8_t)(~pin_mask);
    }

    if (gpiote_channel != ANALOG_PWM_NO_CHANNEL) {
        *regptr(k_timer_pwm_gpiote_base,
                GPIOTE_SUBSCRIBE_SET0 + ((uintptr_t)gpiote_channel * GPIOTE_CONFIG_STRIDE)) = 0U;
        *regptr(k_timer_pwm_gpiote_base,
                GPIOTE_SUBSCRIBE_CLR0 + ((uintptr_t)gpiote_channel * GPIOTE_CONFIG_STRIDE)) = 0U;
        *regptr(k_timer_pwm_gpiote_base,
                GPIOTE_CONFIG0 + ((uintptr_t)gpiote_channel * GPIOTE_CONFIG_STRIDE)) = 0U;
        nrf54l15_gpiote20_release_task_channel(gpiote_channel);
        g_timer_pwm_pin_gpiote_channel[index] = ANALOG_PWM_NO_CHANNEL;
    }

    if (clr_dppi_channel != ANALOG_PWM_NO_CHANNEL) {
        timer_pwm_dppi_release_channel(clr_dppi_channel);
        g_timer_pwm_pin_clr_dppi_channel[index] = ANALOG_PWM_NO_CHANNEL;
    }

    g_timer_pwm_pin_high_ticks[index] = 0UL;
    g_pwm_pin_timer_slot[index] = ANALOG_PWM_NO_SLOT;

    {
        uint8_t port = 0U;
        uint8_t pin = 0U;
        if (resolve_pwm_gpio(index, &port, &pin) != 0U) {
            gpio_write_raw(port, pin, 0U);
        }
    }

    if (g_timer_pwm_slot_member_mask[slot] == 0U) {
        timer_pwm_stop_slot(slot);
        if (g_timer_pwm_slot_set_dppi_channel[slot] != ANALOG_PWM_NO_CHANNEL) {
            timer_pwm_dppi_release_channel(g_timer_pwm_slot_set_dppi_channel[slot]);
            g_timer_pwm_slot_set_dppi_channel[slot] = ANALOG_PWM_NO_CHANNEL;
        }
        g_timer_pwm_slot_prescaler[slot] = 0U;
        g_timer_pwm_slot_period_ticks[slot] = 0UL;
        g_timer_pwm_slot_active[slot] = 0U;
    }
}

static uint8_t timer_pwm_apply_pin(uint8_t index)
{
    if (index >= ANALOG_PWM_PIN_COUNT ||
        pwm_pin_supports_timer_output(index) == 0U ||
        pwm_pin_requests_custom_frequency(index) == 0U) {
        return 0U;
    }

    const uint32_t pulse = g_pwm_pin_pulse[index];
    if (pulse == 0UL || pulse >= (uint32_t)g_pwm_countertop) {
        return 0U;
    }

    uint8_t prescaler = 0U;
    uint32_t period_ticks = 0U;
    if (timer_pwm_compute_timing(pwm_pin_effective_frequency_hz(index),
                                 &prescaler,
                                 &period_ticks) == 0U) {
        timer_pwm_release_pin(index);
        return 0U;
    }

    uint32_t high_ticks =
        (pulse * period_ticks + (uint32_t)(g_pwm_countertop / 2U)) / (uint32_t)g_pwm_countertop;
    if (high_ticks == 0UL) {
        high_ticks = 1UL;
    } else if (high_ticks >= period_ticks) {
        high_ticks = period_ticks - 1UL;
    }

    const uint8_t current_slot = g_pwm_pin_timer_slot[index];
    if (current_slot != ANALOG_PWM_NO_SLOT &&
        timer_pwm_update_pin_live(current_slot, index, prescaler, period_ticks, high_ticks) != 0U) {
        return 1U;
    }

