lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/wiring_analog.c
    if (!found) {
        return 0U;
    }

    *prescaler = best_prescaler;
    *countertop = best_countertop;
    return 1U;
}

static uint8_t pwm_instance_any_dynamic_channel(uint8_t instance)
{
    if (instance >= ANALOG_PWM_INSTANCES) {
        return 0U;
    }
    for (uint8_t ch = 0U; ch < ANALOG_PWM_CHANNELS_PER_INSTANCE; ++ch) {
        const uint8_t owner = g_pwm_channel_owner[instance][ch];
        if (owner == ANALOG_PWM_NO_PIN || owner >= ANALOG_PWM_PIN_COUNT) {
            continue;
        }
        if (g_pwm_pin_pulse[owner] != 0U && g_pwm_pin_pulse[owner] != g_pwm_countertop) {
            return 1U;
        }
    }
    return 0U;
}

static uint8_t pwm_instance_any_used_channel(uint8_t instance)
{
    if (instance >= ANALOG_PWM_INSTANCES) {
        return 0U;
    }
    for (uint8_t ch = 0U; ch < ANALOG_PWM_CHANNELS_PER_INSTANCE; ++ch) {
        const uint8_t owner = g_pwm_channel_owner[instance][ch];
        if (owner != ANALOG_PWM_NO_PIN) {
            return 1U;
        }
    }
    return 0U;
}

static void pwm_disconnect_all(uint8_t instance)
{
    if (instance >= ANALOG_PWM_INSTANCES) {
        return;
    }
    const uintptr_t base = k_pwm_base[instance];
    for (uint8_t ch = 0U; ch < ANALOG_PWM_CHANNELS_PER_INSTANCE; ++ch) {
        *regptr(base, PWM_PSEL_OUT0 + ((uintptr_t)ch * PWM_PSEL_OUT_STRIDE)) = PWM_PSEL_DISCONNECTED;
    }
}

static void pwm_apply_outputs(uint8_t instance)
{
    if (instance >= ANALOG_PWM_INSTANCES) {
        return;
    }

    const uintptr_t base = k_pwm_base[instance];
    pwm_disconnect_all(instance);

    for (uint8_t ch = 0U; ch < ANALOG_PWM_CHANNELS_PER_INSTANCE; ++ch) {
        const uint8_t owner = g_pwm_channel_owner[instance][ch];
        uint8_t port = 0U;
        uint8_t pin = 0U;
        if (owner == ANALOG_PWM_NO_PIN || owner >= ANALOG_PWM_PIN_COUNT) {
            continue;
        }
        if (resolve_pwm_gpio(owner, &port, &pin) == 0U) {
            continue;
        }
        *regptr(base, PWM_PSEL_OUT0 + ((uintptr_t)ch * PWM_PSEL_OUT_STRIDE)) =
            make_gpio_psel(port, pin);
    }
}

static uint32_t soft_pwm_period_us_for_frequency(uint32_t hz)
{
    if (hz == 0UL) {
        return ANALOG_SOFT_PWM_DEFAULT_PERIOD_US;
    }

    const uint32_t rounded = (1000000UL + (hz / 2UL)) / hz;
    return (rounded == 0UL) ? 1UL : rounded;
}

static void analog_write_recompute_active_outputs(uint16_t old_countertop)
{
    if (old_countertop == 0U) {
        old_countertop = 1U;
    }

    for (uint8_t i = 0U; i < ANALOG_PWM_PIN_COUNT; ++i) {
        if (g_pwm_pin_used[i] == 0U) {
            continue;
        }

        uint32_t pulse = g_pwm_pin_pulse[i];
        pulse = (pulse * (uint32_t)g_pwm_countertop + (old_countertop / 2U)) /
                (uint32_t)old_countertop;
        if (pulse > (uint32_t)g_pwm_countertop) {
            pulse = (uint32_t)g_pwm_countertop;
        }
        g_pwm_pin_pulse[i] = (uint16_t)pulse;

        if (pwm_pin_uses_software(i) != 0U) {
            soft_pwm_update_channel(i);
        }
    }

    for (uint8_t instance = 0U; instance < ANALOG_PWM_INSTANCES; ++instance) {
        for (uint8_t ch = 0U; ch < ANALOG_PWM_CHANNELS_PER_INSTANCE; ++ch) {
            const uint8_t owner = g_pwm_channel_owner[instance][ch];
            if (owner == ANALOG_PWM_NO_PIN || owner >= ANALOG_PWM_PIN_COUNT) {
                continue;
            }
            g_pwm_sequence[instance][ch] =
                (uint16_t)(PWM_COMPARE_POLARITY_FALLING_EDGE | (g_pwm_pin_pulse[owner] & 0x7FFFU));
        }
    }
}

static uint8_t pwm_init_once(uint8_t instance)
{
    if (instance >= ANALOG_PWM_INSTANCES) {
        return 0U;
    }
    if (g_pwm_initialized[instance] != 0U) {
        return 1U;
    }

    if (!pwm_compute_timing(g_analog_write_frequency_hz, &g_pwm_prescaler, &g_pwm_countertop)) {
        return 0U;
    }

    const uintptr_t base = k_pwm_base[instance];

    *regptr(base, PWM_ENABLE) = PWM_ENABLE_DISABLED;
    *regptr(base, PWM_SHORTS) = 0U;
    *regptr(base, PWM_MODE) = PWM_MODE_UP;
    *regptr(base, PWM_COUNTERTOP) = (uint32_t)g_pwm_countertop;
    *regptr(base, PWM_PRESCALER) = (uint32_t)g_pwm_prescaler;
    *regptr(base, PWM_DECODER) =
        (PWM_DECODER_LOAD_INDIVIDUAL << 0U) |
        (PWM_DECODER_MODE_REFRESHCOUNT << 8U);
    // A single SEQ[0] START loads a new duty set, and the last loaded duty
    // remains active until the next START or STOP.
    *regptr(base, PWM_LOOP) = 0U;
    *regptr(base, PWM_IDLEOUT) = 0U;
    *regptr(base, PWM_SEQ0_REFRESH) = 0U;
    *regptr(base, PWM_SEQ0_ENDDELAY) = 0U;
    *regptr(base, PWM_SEQ1_REFRESH) = 0U;
    *regptr(base, PWM_SEQ1_ENDDELAY) = 0U;
    pwm_disconnect_all(instance);

    *regptr(base, PWM_DMA_SEQ0_PTR) = (uint32_t)(uintptr_t)&g_pwm_sequence[instance][0];
    *regptr(base, PWM_DMA_SEQ0_MAXCNT) = (uint32_t)sizeof(g_pwm_sequence[instance]);
    *regptr(base, PWM_DMA_SEQ1_PTR) = 0U;
    *regptr(base, PWM_DMA_SEQ1_MAXCNT) = 0U;

    *regptr(base, PWM_ENABLE) = PWM_ENABLE_ENABLED;
    g_pwm_initialized[instance] = 1U;
    return 1U;
}

static void pwm_start_if_needed(uint8_t instance)
{
    if (instance >= ANALOG_PWM_INSTANCES) {
        return;
    }
    if (!pwm_init_once(instance)) {
        return;
    }

    const uintptr_t base = k_pwm_base[instance];

    pwm_apply_outputs(instance);

    *regptr(base, PWM_EVENTS_SEQSTARTED0) = 0U;
    *regptr(base, PWM_EVENTS_RAMUNDERFLOW) = 0U;
    *regptr(base, PWM_EVENTS_DMA_SEQ0_END) = 0U;
    *regptr(base, PWM_SHORTS) = PWM_SHORT_DMA_SEQ0_BUSERROR_STOP;
    *regptr(base, PWM_TASKS_DMA_SEQ_START) = 1U;

    for (uint32_t guard = 0UL; guard < 200000UL; ++guard) {
        if (*regptr(base, PWM_EVENTS_SEQSTARTED0) != 0U) {
            break;
        }
    }
    *regptr(base, PWM_EVENTS_SEQSTARTED0) = 0U;
    g_pwm_running[instance] = 1U;
}

static void pwm_stop_instance(uint8_t instance)
{
    if (instance >= ANALOG_PWM_INSTANCES || g_pwm_initialized[instance] == 0U) {
        return;
    }

    const uintptr_t base = k_pwm_base[instance];

    if (g_pwm_running[instance] != 0U) {
        *regptr(base, PWM_EVENTS_STOPPED) = 0U;
        *regptr(base, PWM_TASKS_STOP) = 1U;
        for (uint32_t guard = 0UL; guard < 200000UL; ++guard) {
            if (*regptr(base, PWM_EVENTS_STOPPED) != 0U) {
                break;
            }
        }
        *regptr(base, PWM_EVENTS_STOPPED) = 0U;
    }

    *regptr(base, PWM_SHORTS) = 0U;
    pwm_disconnect_all(instance);
    *regptr(base, PWM_ENABLE) = PWM_ENABLE_DISABLED;

    g_pwm_running[instance] = 0U;
    g_pwm_initialized[instance] = 0U;
}

void analogWriteDisable(uint8_t pin)
{
    uint8_t pwm_pin = 0U;
    if (!pwm_pin_index_for_pin(pin, &pwm_pin)) {
        return;
    }
    if (g_pwm_pin_used[pwm_pin] == 0U) {
        return;
    }

    g_pwm_pin_used[pwm_pin] = 0U;
    g_pwm_pin_software[pwm_pin] = 0U;
    g_pwm_pin_pulse[pwm_pin] = 0U;
    g_soft_pwm_on_time_us[pwm_pin] = 0UL;
    g_soft_pwm_output_high[pwm_pin] = 0U;
    timer_pwm_release_pin(pwm_pin);

    if (pwm_pin_can_use_hardware(pwm_pin) != 0U) {
        pwm_release_shared_output(pwm_pin);
    }

    {
        uint8_t port = 0U;
        uint8_t pin_in_port = 0U;
        if (resolve_pwm_gpio(pwm_pin, &port, &pin_in_port) != 0U) {
            gpio_write_raw(port, pin_in_port, 0U);
        }
    }
}

static uint8_t select_saadc_resolution_bits(uint8_t requested_bits)
{
    if (requested_bits <= 8U) {
        return 8U;
    }
    if (requested_bits <= 10U) {
        return 10U;
    }
    if (requested_bits <= 12U) {
        return 12U;
    }
    return 14U;
}

static uint32_t scale_resolution(uint32_t value, uint8_t from_bits, uint8_t to_bits)
{
    if (to_bits == from_bits) {
        return value;
    }
    if (to_bits < from_bits) {
        return value >> (from_bits - to_bits);
    }

