lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/wiring_analog.c
    g_pwm_pin_frequency_hz[pwm_pin] = hz;

    if (g_pwm_pin_used[pwm_pin] == 0U) {
        if (hz == 0UL) {
            timer_pwm_release_pin(pwm_pin);
        }
        return;
    }

    if (hz == 0UL) {
        timer_pwm_release_pin(pwm_pin);
    }

    analog_write_apply_pwm_pin(pwm_pin);
}

int analogRead(uint8_t pin)
{
    adc_pin_desc_t d = resolve_analog(pin);
    if (d.ain < 0) {
        return 0;
    }

    const uint8_t hw_bits = select_saadc_resolution_bits(g_analog_read_resolution);
    // Take a second sample after channel setup/calibration to avoid stale first-read artifacts.
    const int first_raw = saadc_sample_pin(d.port, d.pin, hw_bits);
    const int second_raw = saadc_sample_pin(d.port, d.pin, hw_bits);
    const int raw = (second_raw >= 0) ? second_raw : first_raw;
    if (raw <= 0) {
        return 0;
    }

    uint32_t scaled = scale_resolution((uint32_t)raw, hw_bits, g_analog_read_resolution);
    if (scaled > 0x7FFFFFFFUL) {
        scaled = 0x7FFFFFFFUL;
    }
    return (int)scaled;
}

void analogWrite(uint8_t pin, int value)
{
    int max_value;
    if (g_analog_write_resolution >= 16U) {
        max_value = 65535;
    } else {
        max_value = (1 << g_analog_write_resolution) - 1;
    }
    if (max_value <= 0) {
        max_value = 255;
    }
    if (value < 0) {
        value = 0;
    }
    if (value > max_value) {
        value = max_value;
    }

    uint8_t pwm_pin = 0U;
    if (!pwm_pin_index_for_pin(pin, &pwm_pin)) {
        digitalWrite(pin, (value > (max_value / 2)) ? HIGH : LOW);
        return;
    }

    pinMode(pin, OUTPUT);

    uint32_t pulse = 0U;
    if (value > 0) {
        pulse = ((uint32_t)value * (uint32_t)g_pwm_countertop + (uint32_t)(max_value / 2)) /
                (uint32_t)max_value;
        if (pulse > (uint32_t)g_pwm_countertop) {
            pulse = (uint32_t)g_pwm_countertop;
        }
    }

    g_pwm_pin_used[pwm_pin] = 1U;
    g_pwm_pin_pulse[pwm_pin] = (uint16_t)pulse;
    analog_write_apply_pwm_pin(pwm_pin);
}

void tone(uint8_t pin, unsigned int frequency, unsigned long duration)
{
    if (frequency == 0U) {
        return;
    }

    const unsigned long period_us = 1000000UL / frequency;
    const unsigned long half = (period_us > 1UL) ? (period_us / 2UL) : 1UL;

    if (duration == 0UL) {
        duration = period_us * 8UL;
    }

    const unsigned long start = millis();
    while ((millis() - start) < duration) {
        digitalWrite(pin, HIGH);
        delayMicroseconds((unsigned int)half);
        digitalWrite(pin, LOW);
        delayMicroseconds((unsigned int)half);
    }
}

void noTone(uint8_t pin)
{
    digitalWrite(pin, LOW);
}
